FILES/Catalogs/ПечатныеФормыКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ПечатныеФормыКлиента</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокОбъектов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтборОбъекта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭлементОтбора</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокКоманд</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторНаСтрокуОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяКомандыURL</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФорматВывода</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаНаПечатнуюФорму</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИПечатныеФормы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FILES/Catalogs/ПечатныеФормыКлиента/Ext/ManagerModule.bsl
Функция ПолучитьСписокПечатныхФормКлиента(Контрагент) Экспорт 
	
	Зарпос = Новый Запрос;
	Зарпос.УстановитьПараметр("Партнер", Контрагент.Партнер);
	Зарпос.УстановитьПараметр("Контрагент", Контрагент);
	Зарпос.Текст = "ВЫБРАТЬ
	               |	ПечатныеФормыКлиентаСписокКоманд.Ссылка КАК Ссылка,
	               |	ПечатныеФормыКлиентаСписокКоманд.ИдентификаторНаСтрокуОбъекта КАК ИдентификаторНаСтрокуОбъекта,
	               |	ПечатныеФормыКлиентаСписокКоманд.ИмяКоманды КАК ИмяКоманды,
	               |	ПечатныеФормыКлиентаСписокКоманд.ПредставлениеКоманды КАК ПредставлениеКоманды,
	               |	ПечатныеФормыКлиентаСписокКоманд.Использовать КАК Использовать,
	               |	ПечатныеФормыКлиентаСписокКоманд.ФорматВывода КАК ФорматВывода,
	               |	ПечатныеФормыКлиентаСписокОбъектов.ОбъектМетаданных КАК ОбъектМетаданных,
	               |	ПечатныеФормыКлиентаСписокОбъектов.ОтборОбъекта КАК ОтборОбъекта
	               |ПОМЕСТИТЬ ПоУмолчанию
	               |ИЗ
	               |	Справочник.ПечатныеФормыКлиента.СписокКоманд КАК ПечатныеФормыКлиентаСписокКоманд
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПечатныеФормыКлиента.СписокОбъектов КАК ПечатныеФормыКлиентаСписокОбъектов
	               |		ПО ПечатныеФормыКлиентаСписокКоманд.Ссылка = ПечатныеФормыКлиентаСписокОбъектов.Ссылка
	               |ГДЕ
	               |	ПечатныеФормыКлиентаСписокКоманд.Ссылка.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	               |	И ПечатныеФормыКлиентаСписокКоманд.Ссылка.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПечатныеФормыКлиентаСписокКоманд.Ссылка КАК Ссылка,
	               |	ПечатныеФормыКлиентаСписокКоманд.ИдентификаторНаСтрокуОбъекта КАК ИдентификаторНаСтрокуОбъекта,
	               |	ПечатныеФормыКлиентаСписокКоманд.ИмяКоманды КАК ИмяКоманды,
	               |	ПечатныеФормыКлиентаСписокКоманд.ПредставлениеКоманды КАК ПредставлениеКоманды,
	               |	ПечатныеФормыКлиентаСписокКоманд.Использовать КАК Использовать,
	               |	ПечатныеФормыКлиентаСписокКоманд.ФорматВывода КАК ФорматВывода,
	               |	ПечатныеФормыКлиентаСписокОбъектов.ОбъектМетаданных КАК ОбъектМетаданных,
	               |	ПечатныеФормыКлиентаСписокОбъектов.ОтборОбъекта КАК ОтборОбъекта
	               |ПОМЕСТИТЬ ДляКонтрагента
	               |ИЗ
	               |	Справочник.ПечатныеФормыКлиента.СписокКоманд КАК ПечатныеФормыКлиентаСписокКоманд
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПечатныеФормыКлиента.СписокОбъектов КАК ПечатныеФормыКлиентаСписокОбъектов
	               |		ПО ПечатныеФормыКлиентаСписокКоманд.Ссылка = ПечатныеФормыКлиентаСписокОбъектов.Ссылка
	               |ГДЕ
	               |	ПечатныеФормыКлиентаСписокКоманд.Ссылка.Партнер = &Партнер
	               |	И ПечатныеФормыКлиентаСписокКоманд.Ссылка.Контрагент = &Контрагент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПоУмолчанию.Ссылка КАК Ссылка,
	               |	ПоУмолчанию.ИдентификаторНаСтрокуОбъекта КАК ИдентификаторНаСтрокуОбъекта,
	               |	ПоУмолчанию.ИмяКоманды КАК ИмяКоманды,
	               |	ПоУмолчанию.ПредставлениеКоманды КАК ПредставлениеКоманды,
	               |	ПоУмолчанию.Использовать КАК Использовать,
	               |	ПоУмолчанию.ФорматВывода КАК ФорматВывода,
	               |	ПоУмолчанию.ОбъектМетаданных КАК ОбъектМетаданных,
	               |	ПоУмолчанию.ОтборОбъекта КАК ОтборОбъекта
	               |ИЗ
	               |	ПоУмолчанию КАК ПоУмолчанию
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ДляКонтрагента.Ссылка,
	               |	ДляКонтрагента.ИдентификаторНаСтрокуОбъекта,
	               |	ДляКонтрагента.ИмяКоманды,
	               |	ДляКонтрагента.ПредставлениеКоманды,
	               |	ДляКонтрагента.Использовать,
	               |	ДляКонтрагента.ФорматВывода,
	               |	ДляКонтрагента.ОбъектМетаданных,
	               |	ДляКонтрагента.ОтборОбъекта
	               |ИЗ
	               |	ДляКонтрагента КАК ДляКонтрагента";
	Выгрузка = Зарпос.Выполнить().Выгрузить();
	
	Возврат Выгрузка;
КонецФункции
